package homework_3.oop;


/*
Есть такая ситуация: в университете есть лекторы и студенты.
О каждом лекторе известно его имя, фамилия, преподаваемый предмет
(назовеём это специализация) и группа судентов, которую он курирует.
О студенте известно имя, фамилия, курс и специализация. У студентов
должна быть возможность записаться в группу к лектору, но при таком
условии: группа кандидатов должна набраться 5 человек. Лектор проверяет,
что специализация кандидатов соответствует его собственной и, если ок,
то записывает их в свою группу.
*/

public class OOP {









}
